# copyinstallerNEW - копирует дистрибутив на компьютер. Это архив zip и инсталлятор
function copyinstallerNEW {

    Import-Module .\config\Modules\06CopyInstallerFile

   if ($zip -eq 1) {

           #####################################################################

           # начало копирования ZIP

           startInstallZIP

           # Конец
           #####################################################################

   }
   else {

           #####################################################################
           # Копирование EXE Начало

           CopyExeFile

           # Конец
           #####################################################################

   }
}
